# tap "homebrew/services"
tap "mas-cli/tap"

# Brews
##########################
brew "codespell"
brew "coreutils"
brew "fd"
brew "fish"
brew "gh"
brew "git-crypt"
brew "gnupg"
brew "jq"
brew "lsd"
brew "pcre"
brew "pv"
brew "ranger"
brew "ripgrep"
brew "starship"
brew "wget"
# brew "zsh"
brew "zlib"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"

{{- if eq .chezmoi.os "darwin" }}
brew "mas"

# Casks
##########################
cask "google-chrome"
# cask "docker"
cask "figma"
# cask "kdiff3"
cask "postman"
cask "visual-studio-code"
cask "zed"

# Font Casks
# cask "font-cascadia-code"  # FAILING!!!
# cask "font-0xproto-nerd-font"
# cask "font-3270-nerd-font"
# cask "font-agave-nerd-font"
# cask "font-anonymice-nerd-font"
# cask "font-arimo-nerd-font"
# cask "font-aurulent-sans-mono-nerd-font"
# cask "font-bigblue-terminal-nerd-font"
cask "font-bitstream-vera-sans-mono-nerd-font"
# cask "font-blex-mono-nerd-font"
cask "font-caskaydia-cove-nerd-font"
cask "font-caskaydia-mono-nerd-font"
# cask "font-code-new-roman-nerd-font"
# cask "font-comic-shanns-mono-nerd-font"
# cask "font-commit-mono-nerd-font"
# cask "font-cousine-nerd-font"
# cask "font-d2coding-nerd-font"
# cask "font-daddy-time-mono-nerd-font"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-droid-sans-mono-nerd-font"
# cask "font-envy-code-r-nerd-font"
# cask "font-fantasque-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
# cask "font-fira-mono-nerd-font"
# cask "font-geist-mono-nerd-font"
# cask "font-go-mono-nerd-font"
# cask "font-gohufont-nerd-font"
# cask "font-hack-nerd-font"
# cask "font-hasklug-nerd-font"
# cask "font-heavy-data-nerd-font"
# cask "font-hurmit-nerd-font"
# cask "font-im-writing-nerd-font"
# cask "font-inconsolata-go-nerd-font"
# cask "font-inconsolata-lgc-nerd-font"
# cask "font-inconsolata-nerd-font"
# cask "font-intone-mono-nerd-font"
# cask "font-iosevka-nerd-font"
# cask "font-iosevka-term-nerd-font"
# cask "font-iosevka-term-slab-nerd-font"
cask "font-jetbrains-mono-nerd-font"
# cask "font-lekton-nerd-font"
# cask "font-liberation-nerd-font"
# cask "font-lilex-nerd-font"
# cask "font-m+-nerd-font"
# cask "font-martian-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
# cask "font-monaspace-nerd-font"
# cask "font-monocraft-nerd-font"
# cask "font-monofur-nerd-font"
# cask "font-monoid-nerd-font"
cask "font-mononoki-nerd-font"
# cask "font-noto-nerd-font"
# cask "font-open-dyslexic-nerd-font"
# cask "font-overpass-nerd-font"
# cask "font-profont-nerd-font"
# cask "font-proggy-clean-tt-nerd-font"
# cask "font-recursive-mono-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"
# cask "font-shure-tech-mono-nerd-font"
# cask "font-space-mono-nerd-font"
# cask "font-symbols-only-nerd-font"  # FAILING!!!
# cask "font-terminess-ttf-nerd-font"
# cask "font-tinos-nerd-font"
# cask "font-ubuntu-mono-nerd-font"
# cask "font-ubuntu-nerd-font"
# cask "font-ubuntu-sans-nerd-font"
# cask "font-victor-mono-nerd-font"
# cask "font-zed-mono-nerd-font"
{{ end }}

# VSCode Extensions
#########################################
vscode "alexkrechik.cucumberautocomplete"
vscode "arjun.swagger-viewer"
vscode "blodwynn.featurehighlight"
# vscode "bmalehorn.vscode-fish"
vscode "bung87.vscode-gemfile"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
# vscode "dart-code.dart-code"
# vscode "dart-code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "dunstontc.viml"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
# vscode "github.copilot"
# vscode "github.copilot-chat"
vscode "jakebecker.elixir-ls"
vscode "karunamurti.haml"
vscode "koichisasada.vscode-rdbg"
vscode "mechatroner.rainbow-csv"
vscode "mohsen1.prettify-json"
vscode "ms-azuretools.vscode-docker"
vscode "msjsdiag.vscode-react-native"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "shopify.ruby-extensions-pack"
vscode "shopify.ruby-lsp"
vscode "sianglim.slim"
vscode "simonsiefke.svg-preview"
vscode "sorbet.sorbet-vscode-extension"
vscode "steoates.autoimport"
vscode "t-sauer.autolinting-for-javascript"
vscode "tamasfe.even-better-toml"
vscode "tyriar.sort-lines"
vscode "vue.volar"
vscode "zhuangtongfa.material-theme"
vscode "zignd.html-css-class-completion"

{{- if eq .vscode.vim_mode "true" }}
vscode "vscodevim.vim"
{{ end }}

{{- if eq .chezmoi.os "darwin" }}
# Apple App Store
#########################################
{{ end }}
