cask_args appdir: '/Applications'

tap 'homebrew/core'
tap 'homebrew/bundle'
tap 'homebrew/services'
tap 'github/bootstrap'
# tap 'puma/puma'
tap 'caskroom/cask'

brew 'ack'
brew 'coreutils'
# brew 'elasticsearch', restart_service: true
# brew 'elixir
# brew 'erlang'
brew 'git'
brew 'go'
brew 'grc'
# brew 'httrack'
brew 'imagemagick'
brew 'jp2a'
brew 'jq'
brew 'libcaca', args: ['with-imlib2']
brew 'libgit2'
brew 'mas'
# brew 'memcached', restart_service: true
# brew 'mongodb', restart_service: true
# brew 'nodenv'
brew 'openssl'
# brew 'python3'
brew 'readline'
# brew 'postgresql', restart_service: true
# brew 'puma/puma/puma-dev'
# brew 'redis', restart_service: true
# brew 'ripgrep'
brew 'ruby-build'
brew 'rbenv'
# brew 'rbenv-default-gems'
brew 'roundup'
# brew 'shellcheck'
brew 'unrar'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'
# brew 'vim'
brew 'zsh'
# brew 'zshplug'

# cask 'adium'
cask 'atom'
# cask 'cheatsheet'
cask 'firefox'
# cask 'fork'
cask 'google-chrome'
cask 'handbrake'
cask 'iterm2'
cask 'java'
cask 'kdiff3'
# cask 'mapbox-studio'
cask 'quitter'
cask 'screenhero'
# cask 'sourcetree'
cask 'spotify'
# cask 'transmission'
# cask 'tunnelbear'
# cask 'typora'
# cask 'vagrant'
# cask 'vagrant-manager'
# cask 'viscosity'
# cask 'vmware-fusion'
cask 'vlc'
cask 'xquartz'
# cask 'zoomus'

# mas "Affinity Designer", id:
# mas "Affinity Photo", id:
# mas "Mactracker", id: 430255202
# mas "Pixelmator", id: 407963104
# mas "Sketch", id: 402476602
# mas "Slack", id: 803453959
# mas "Xcode", id: 497799835
