tap "dagger/tap"
tap "FelixKratz/formulae"
tap "goreleaser/tap"
tap "homebrew/bundle"
# tap "homebrew/cask"
tap "homebrew/cask-fonts"
# tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "sporkd/fonts", "https://gitlab.com/sporkd/homebrew-fonts.git"

brew "awscli"
brew "blueutil"
brew "codespell"
brew "colima"
brew "coreutils"
brew "dagger/tap/dagger"
brew "docker"
brew "fish" # having trouble setting tea version to default
brew "fontforge"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "lsd"
# brew "markdownlint-cli"
# brew "mpc"
# brew "mpd"
brew "neovim"
# brew "ncmpcpp"
brew "ranger"
# brew "ruby" # tea version not playing well with editors?
brew "sketchybar"
brew "starship"
brew "tree-sitter"
brew "z"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"

cask "android-ndk"
cask "android-studio"
# cask "docker"
# cask "discord"
cask "disk-inventory-x"
# cask "figma"
# cask "firefox"
cask "flutter"
cask "font-cascadia-code"
# cask "font-fira-code"
# cask "font-fira-mono-for-powerline"
# cask "font-lato"
# cask "font-menlo-for-powerline"
cask "font-meslo-lgs-nf"
cask "font-monaco-for-powerline"
# cask "font-roboto"
cask "font-hack-nerd-font"
cask "font-symbols-only-nerd-font"
# cask "google-chrome"
cask "istat-menus"
# cask "iterm2"
cask "karabiner-elements"
cask "kdiff3"
# cask "kitematic"
# cask "kitty"
cask "lunar"
cask "mpv"
cask "notunes"
# cask "postman"
cask "rocket"
cask "visual-studio-code"
# cask "xquartz"

# giphy : https://tenor.com/mac
# cleanshot: https://cleanshot.com/

vscode "alexkrechik.cucumberautocomplete"
vscode "Arjun.swagger-viewer"
vscode "Blodwynn.featurehighlight"
vscode "bmalehorn.vscode-fish"
vscode "bung87.vscode-gemfile"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "Dart-Code.dart-code"
vscode "Dart-Code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "dunstontc.viml"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "JakeBecker.elixir-ls"
vscode "KoichiSasada.vscode-rdbg"
vscode "mohsen1.prettify-json"
vscode "ms-azuretools.vscode-docker"
vscode "msjsdiag.vscode-react-native"
vscode "oderwat.indent-rainbow"
vscode "PKief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "Shopify.ruby-extensions-pack"
vscode "Shopify.ruby-lsp"
vscode "sianglim.slim"
vscode "simonsiefke.svg-preview"
vscode "sorbet.sorbet-vscode-extension"
vscode "steoates.autoimport"
vscode "t-sauer.autolinting-for-javascript"
vscode "tamasfe.even-better-toml"
vscode "Tyriar.sort-lines"
vscode "vscodevim.vim"
vscode "Vue.volar"
vscode "Zignd.html-css-class-completion"
vscode "zhuangtongfa.material-theme"
