cask_args appdir: '/Applications'

tap 'homebrew/core'
tap 'homebrew/bundle'
tap 'homebrew/services'
tap 'github/bootstrap'
# tap 'puma/puma'
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'sporkd/fonts', 'git@github.com:sporkd/homebrew-fonts.git'

brew 'ack'
brew 'asdf'
brew 'coreutils'
brew 'easy-tag'
brew 'elasticsearch', restart_service: true
brew 'git'
brew 'go'
brew 'gnupg'
brew 'grc'
# brew 'httrack'
brew 'hub'
brew 'imagemagick'
brew 'jp2a'
brew 'jq'
brew 'libcaca', args: ['with-imlib2']
brew 'libgit2'
brew 'libxslt'
brew 'mas'

# https://apple.stackexchange.com/questions/311442/broken-terminal
# brew 'mercurial'

brew 'memcached', restart_service: true
# brew 'mongodb', restart_service: true
brew 'neovim'
brew 'openssl'
brew 'python3'
brew 'readline'
brew 'postgresql', restart_service: true
# brew 'puma/puma/puma-dev'
brew 'redis', restart_service: true
# brew 'ripgrep'
brew 'roundup'
# brew 'shellcheck'
brew 'unrar'
brew 'wget'
brew 'yarn', args: ['without-node']
brew 'youtube-dl'
# brew 'vim'
brew 'zsh'
# brew 'zplug'  # manual install for now

# Casks
# cask 'adium'
cask 'atom'
# cask 'cheatsheet'
cask 'db-browser-for-sqlite'
# cask 'docker'
cask 'figma'
cask 'firefox'
# cask 'fork'
# cask 'framer'
# cask 'google-chrome'
cask 'handbrake'
cask 'hyper'
cask 'iterm2'
cask 'java'
cask 'java8'
cask 'kdiff3'
# cask 'mapbox-studio'
cask 'now'
cask 'postman'
cask 'quitter'
cask 'slack'
# cask 'sourcetree'
cask 'spotify'
# cask 'transmission'
# cask 'tunnelbear'
# cask 'typora'
# cask 'vagrant'
# cask 'vagrant-manager'
# cask 'viscosity'
# cask 'vmware-fusion'
cask 'vlc'
cask 'xquartz'
# cask 'zoomus'

# Fonts
cask 'font-fira-code'
cask 'font-fira-mono-for-powerline'
cask 'font-lato'
cask 'font-menlo-for-powerline'
cask 'font-monaco-for-powerline'
cask 'font-montserrat'
cask 'font-oswald'
cask 'font-roboto'

# mas "Affinity Designer", id:
# mas "Affinity Photo", id:
# mas "Mactracker", id: 430255202
# mas "Pixelmator", id: 407963104
# mas "Sketch", id: 402476602
# mas "Slack", id: 803453959
# mas "Xcode", id: 497799835
